// js/data.js
const franchises = [
  {
    id: 1,
    name: "Атака титанов",
    category: "Аниме",
    genre: "Тёмное фэнтези, Постапокалипсис",
    shortDesc: "Человечество выживает за стенами, защищаясь от гигантских титанов.",
    fullDesc: "В мире, где человечество живёт внутри трёх огромных стен, внезапное появление сверхгигантского титана разрушает стену Мария и меняет ход истории...",
    image: "assets/images/aot.jpg"
  },
  {
    id: 2,
    name: "Пила",
    category: "Хоррор",
    genre: "Триллер, Ужасы",
    shortDesc: "Загадочный конструктор проводит смертельные испытания над жертвами.",
    fullDesc: "Фильм рассказывает о серии жестоких испытаний, организованных загадочным серийным убийцей по прозвищу 'Конструктор'...",
    image: "assets/images/saw.jpg"
  },
    {
    id: 3,
    name: "Resident Evil 4",
    category: "Хоррор",
    genre: "Триллер, Ужасы",
    shortDesc: "Леон спасает дочь презедента в глухой испанской деревне, но с жителями явно чтото не то.",
    fullDesc: "Фильм рассказывает о серии жестоких испытаний, организованных загадочным серийным убийцей по прозвищу 'Конструктор'...",
    image: "assets/images/saw.jpg"
  },
    {
    id: 2,
    name: "Пила",
    category: "Хоррор",
    genre: "Триллер, Ужасы",
    shortDesc: "Загадочный конструктор проводит смертельные испытания над жертвами.",
    fullDesc: "Фильм рассказывает о серии жестоких испытаний, организованных загадочным серийным убийцей по прозвищу 'Конструктор'...",
    image: "assets/images/saw.jpg"
  },
    {
    id: 2,
    name: "Пила",
    category: "Хоррор",
    genre: "Триллер, Ужасы",
    shortDesc: "Загадочный конструктор проводит смертельные испытания над жертвами.",
    fullDesc: "Фильм рассказывает о серии жестоких испытаний, организованных загадочным серийным убийцей по прозвищу 'Конструктор'...",
    image: "assets/images/saw.jpg"
  },
    {
    id: 2,
    name: "Пила",
    category: "Хоррор",
    genre: "Триллер, Ужасы",
    shortDesc: "Загадочный конструктор проводит смертельные испытания над жертвами.",
    fullDesc: "Фильм рассказывает о серии жестоких испытаний, организованных загадочным серийным убийцей по прозвищу 'Конструктор'...",
    image: "assets/images/saw.jpg"
  },
    {
    id: 2,
    name: "Пила",
    category: "Хоррор",
    genre: "Триллер, Ужасы",
    shortDesc: "Загадочный конструктор проводит смертельные испытания над жертвами.",
    fullDesc: "Фильм рассказывает о серии жестоких испытаний, организованных загадочным серийным убийцей по прозвищу 'Конструктор'...",
    image: "assets/images/saw.jpg"
  },
    {
    id: 2,
    name: "Пила",
    category: "Хоррор",
    genre: "Триллер, Ужасы",
    shortDesc: "Загадочный конструктор проводит смертельные испытания над жертвами.",
    fullDesc: "Фильм рассказывает о серии жестоких испытаний, организованных загадочным серийным убийцей по прозвищу 'Конструктор'...",
    image: "assets/images/saw.jpg"
  },
    {
    id: 2,
    name: "Пила",
    category: "Хоррор",
    genre: "Триллер, Ужасы",
    shortDesc: "Загадочный конструктор проводит смертельные испытания над жертвами.",
    fullDesc: "Фильм рассказывает о серии жестоких испытаний, организованных загадочным серийным убийцей по прозвищу 'Конструктор'...",
    image: "assets/images/saw.jpg"
  },
    {
    id: 2,
    name: "Пила",
    category: "Хоррор",
    genre: "Триллер, Ужасы",
    shortDesc: "Загадочный конструктор проводит смертельные испытания над жертвами.",
    fullDesc: "Фильм рассказывает о серии жестоких испытаний, организованных загадочным серийным убийцей по прозвищу 'Конструктор'...",
    image: "assets/images/saw.jpg"
  },
    {
    id: 2,
    name: "Пила",
    category: "Хоррор",
    genre: "Триллер, Ужасы",
    shortDesc: "Загадочный конструктор проводит смертельные испытания над жертвами.",
    fullDesc: "Фильм рассказывает о серии жестоких испытаний, организованных загадочным серийным убийцей по прозвищу 'Конструктор'...",
    image: "assets/images/saw.jpg"
  },
    {
    id: 2,
    name: "Пила",
    category: "Хоррор",
    genre: "Триллер, Ужасы",
    shortDesc: "Загадочный конструктор проводит смертельные испытания над жертвами.",
    fullDesc: "Фильм рассказывает о серии жестоких испытаний, организованных загадочным серийным убийцей по прозвищу 'Конструктор'...",
    image: "assets/images/saw.jpg"
  },
    {
    id: 2,
    name: "Пила",
    category: "Хоррор",
    genre: "Триллер, Ужасы",
    shortDesc: "Загадочный конструктор проводит смертельные испытания над жертвами.",
    fullDesc: "Фильм рассказывает о серии жестоких испытаний, организованных загадочным серийным убийцей по прозвищу 'Конструктор'...",
    image: "assets/images/saw.jpg"
  },
    {
    id: 2,
    name: "Пила",
    category: "Хоррор",
    genre: "Триллер, Ужасы",
    shortDesc: "Загадочный конструктор проводит смертельные испытания над жертвами.",
    fullDesc: "Фильм рассказывает о серии жестоких испытаний, организованных загадочным серийным убийцей по прозвищу 'Конструктор'...",
    image: "assets/images/saw.jpg"
  },
  // 📌 Скопируйте объект выше, вставьте сюда и измените данные.
  // Минимум 12 карточек по ТЗ.
];